Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/include/pio/pic32cz2051ca80100.h
#define PIN_PA01K_ETH_TXD0                         _UINT32_(1) 
#define MUX_PA01K_ETH_TXD0                         _UINT32_(10)
#define PINMUX_PA01K_ETH_TXD0                      ((PIN_PA01K_ETH_TXD0 << 16) | MUX_PA01K_ETH_TXD0)
#define PORT_PA01K_ETH_TXD0                        (_UINT32_(1) << 1)

#define PIN_PA00K_ETH_TXD1                         _UINT32_(0) 
#define MUX_PA00K_ETH_TXD1                         _UINT32_(10)
#define PINMUX_PA00K_ETH_TXD1                      ((PIN_PA00K_ETH_TXD1 << 16) | MUX_PA00K_ETH_TXD1)
#define PORT_PA00K_ETH_TXD1                        (_UINT32_(1) << 0)

#define PIN_PD04K_ETH_TXD2                         _UINT32_(100)
#define MUX_PD04K_ETH_TXD2                         _UINT32_(10)
#define PINMUX_PD04K_ETH_TXD2                      ((PIN_PD04K_ETH_TXD2 << 16) | MUX_PD04K_ETH_TXD2)
#define PORT_PD04K_ETH_TXD2                        (_UINT32_(1) << 4)

#define PIN_PD03K_ETH_TXD3                         _UINT32_(99)
#define MUX_PD03K_ETH_TXD3                         _UINT32_(10)
#define PINMUX_PD03K_ETH_TXD3                      ((PIN_PD03K_ETH_TXD3 << 16) | MUX_PD03K_ETH_TXD3)
#define PORT_PD03K_ETH_TXD3                        (_UINT32_(1) << 3)

#define PIN_PA02K_ETH_TXEN                         _UINT32_(2) 
#define MUX_PA02K_ETH_TXEN                         _UINT32_(10)
#define PINMUX_PA02K_ETH_TXEN                      ((PIN_PA02K_ETH_TXEN << 16) | MUX_PA02K_ETH_TXEN)
#define PORT_PA02K_ETH_TXEN                        (_UINT32_(1) << 2)

#define PIN_PD02K_ETH_TXER                         _UINT32_(98)
#define MUX_PD02K_ETH_TXER                         _UINT32_(10)
#define PINMUX_PD02K_ETH_TXER                      ((PIN_PD02K_ETH_TXER << 16) | MUX_PD02K_ETH_TXER)
#define PORT_PD02K_ETH_TXER                        (_UINT32_(1) << 2)

#define PIN_PD05K_ETH_TX_CLK                       _UINT32_(101)
#define MUX_PD05K_ETH_TX_CLK                       _UINT32_(10)
#define PINMUX_PD05K_ETH_TX_CLK                    ((PIN_PD05K_ETH_TX_CLK << 16) | MUX_PD05K_ETH_TX_CLK)
#define PORT_PD05K_ETH_TX_CLK                      (_UINT32_(1) << 5)

/* ========== PORT definition for GCLK peripheral ========== */
#define PIN_PC20M_GCLK_IO0                         _UINT32_(84)
#define MUX_PC20M_GCLK_IO0                         _UINT32_(12)
#define PINMUX_PC20M_GCLK_IO0                      ((PIN_PC20M_GCLK_IO0 << 16) | MUX_PC20M_GCLK_IO0)
#define PORT_PC20M_GCLK_IO0                        (_UINT32_(1) << 20)

#define PIN_PC19M_GCLK_IO1                         _UINT32_(83)
#define MUX_PC19M_GCLK_IO1                         _UINT32_(12)
#define PINMUX_PC19M_GCLK_IO1                      ((PIN_PC19M_GCLK_IO1 << 16) | MUX_PC19M_GCLK_IO1)
#define PORT_PC19M_GCLK_IO1                        (_UINT32_(1) << 19)

#define PIN_PD00M_GCLK_IO2                         _UINT32_(96)
#define MUX_PD00M_GCLK_IO2                         _UINT32_(12)
#define PINMUX_PD00M_GCLK_IO2                      ((PIN_PD00M_GCLK_IO2 << 16) | MUX_PD00M_GCLK_IO2)
#define PORT_PD00M_GCLK_IO2                        (_UINT32_(1) << 0)

#define PIN_PD01M_GCLK_IO3                         _UINT32_(97)
#define MUX_PD01M_GCLK_IO3                         _UINT32_(12)
#define PINMUX_PD01M_GCLK_IO3                      ((PIN_PD01M_GCLK_IO3 << 16) | MUX_PD01M_GCLK_IO3)
#define PORT_PD01M_GCLK_IO3                        (_UINT32_(1) << 1)

#define PIN_PC00M_GCLK_IO4                         _UINT32_(64)
#define MUX_PC00M_GCLK_IO4                         _UINT32_(12)
#define PINMUX_PC00M_GCLK_IO4                      ((PIN_PC00M_GCLK_IO4 << 16) | MUX_PC00M_GCLK_IO4)
#define PORT_PC00M_GCLK_IO4                        (_UINT32_(1) << 0)

#define PIN_PC01M_GCLK_IO5                         _UINT32_(65)
#define MUX_PC01M_GCLK_IO5                         _UINT32_(12)
#define PINMUX_PC01M_GCLK_IO5                      ((PIN_PC01M_GCLK_IO5 << 16) | MUX_PC01M_GCLK_IO5)
#define PORT_PC01M_GCLK_IO5                        (_UINT32_(1) << 1)

#define PIN_PC02M_GCLK_IO6                         _UINT32_(66)
#define MUX_PC02M_GCLK_IO6                         _UINT32_(12)
#define PINMUX_PC02M_GCLK_IO6                      ((PIN_PC02M_GCLK_IO6 << 16) | MUX_PC02M_GCLK_IO6)
#define PORT_PC02M_GCLK_IO6                        (_UINT32_(1) << 2)

#define PIN_PC03M_GCLK_IO7                         _UINT32_(67)
#define MUX_PC03M_GCLK_IO7                         _UINT32_(12)
#define PINMUX_PC03M_GCLK_IO7                      ((PIN_PC03M_GCLK_IO7 << 16) | MUX_PC03M_GCLK_IO7)
#define PORT_PC03M_GCLK_IO7                        (_UINT32_(1) << 3)

#define PIN_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(68)
#define MUX_PC04J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PC04J_GCLK_spi_ixs_mclk0            ((PIN_PC04J_GCLK_spi_ixs_mclk0 << 16) | MUX_PC04J_GCLK_spi_ixs_mclk0)
#define PORT_PC04J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 4)

#define PIN_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(102)
#define MUX_PD06J_GCLK_spi_ixs_mclk0               _UINT32_(9) 
#define PINMUX_PD06J_GCLK_spi_ixs_mclk0            ((PIN_PD06J_GCLK_spi_ixs_mclk0 << 16) | MUX_PD06J_GCLK_spi_ixs_mclk0)
#define PORT_PD06J_GCLK_spi_ixs_mclk0              (_UINT32_(1) << 6)

/* ========== PORT definition for MLB peripheral ========== */
#define PIN_PD07G_MLB_MLBC                         _UINT32_(103)
#define MUX_PD07G_MLB_MLBC                         _UINT32_(6) 
#define PINMUX_PD07G_MLB_MLBC                      ((PIN_PD07G_MLB_MLBC << 16) | MUX_PD07G_MLB_MLBC)
#define PORT_PD07G_MLB_MLBC                        (_UINT32_(1) << 7)

#define PIN_PD09G_MLB_MLBD                         _UINT32_(105)
#define MUX_PD09G_MLB_MLBD                         _UINT32_(6) 
#define PINMUX_PD09G_MLB_MLBD                      ((PIN_PD09G_MLB_MLBD << 16) | MUX_PD09G_MLB_MLBD)
#define PORT_PD09G_MLB_MLBD                        (_UINT32_(1) << 9)

#define PIN_PD08G_MLB_MLBS                         _UINT32_(104)
#define MUX_PD08G_MLB_MLBS                         _UINT32_(6) 
#define PINMUX_PD08G_MLB_MLBS                      ((PIN_PD08G_MLB_MLBS << 16) | MUX_PD08G_MLB_MLBS)
#define PORT_PD08G_MLB_MLBS                        (_UINT32_(1) << 8)

